deneyapkart/deneyapkart-arduino-core/boards.txt
dydk1a_mpv10.menu.DebugLevel.none=None
dydk1a_mpv10.menu.DebugLevel.none.build.code_debug=0
dydk1a_mpv10.menu.DebugLevel.error=Error
dydk1a_mpv10.menu.DebugLevel.error.build.code_debug=1
dydk1a_mpv10.menu.DebugLevel.warn=Warn
dydk1a_mpv10.menu.DebugLevel.warn.build.code_debug=2
dydk1a_mpv10.menu.DebugLevel.info=Info
dydk1a_mpv10.menu.DebugLevel.info.build.code_debug=3
dydk1a_mpv10.menu.DebugLevel.debug=Debug
dydk1a_mpv10.menu.DebugLevel.debug.build.code_debug=4
dydk1a_mpv10.menu.DebugLevel.verbose=Verbose
dydk1a_mpv10.menu.DebugLevel.verbose.build.code_debug=5

dydk1a_mpv10.menu.EraseFlash.none=Disabled
dydk1a_mpv10.menu.EraseFlash.none.upload.erase_cmd=
dydk1a_mpv10.menu.EraseFlash.all=Enabled
dydk1a_mpv10.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

dydk1a_mpv20.name=Deneyap Kart 1A v2

dydk1a_mpv20.vid.0=0x303A
dydk1a_mpv20.pid.0=0x8147

dydk1a_mpv20.bootloader.tool=esptool_py
dydk1a_mpv20.bootloader.tool.default=esptool_py

dydk1a_mpv20.upload.tool=esptool_py
dydk1a_mpv20.upload.tool.default=esptool_py
dydk1a_mpv20.upload.tool.network=esp_ota

dydk1a_mpv20.upload.maximum_size=1310720
dydk1a_mpv20.upload.maximum_data_size=327680
dydk1a_mpv20.upload.flags=
dydk1a_mpv20.upload.extra_flags=
dydk1a_mpv20.upload.use_1200bps_touch=false
dydk1a_mpv20.upload.wait_for_upload_port=false

dydk1a_mpv20.serial.disableDTR=false
dydk1a_mpv20.serial.disableRTS=false

dydk1a_mpv20.build.tarch=xtensa
dydk1a_mpv20.build.bootloader_addr=0x0
dydk1a_mpv20.build.target=esp32s3
dydk1a_mpv20.build.mcu=esp32s3
dydk1a_mpv20.build.core=esp32
dydk1a_mpv20.build.variant=dydk1a_mpv20
dydk1a_mpv20.build.board=DYDK1Av2

dydk1a_mpv20.build.usb_mode=1
dydk1a_mpv20.build.cdc_on_boot=0
dydk1a_mpv20.build.msc_on_boot=0
dydk1a_mpv20.build.dfu_on_boot=0
dydk1a_mpv20.build.f_cpu=240000000L
dydk1a_mpv20.build.flash_size=4MB
dydk1a_mpv20.build.flash_freq=80m
dydk1a_mpv20.build.flash_mode=dio
dydk1a_mpv20.build.boot=qio
dydk1a_mpv20.build.boot_freq=80m
dydk1a_mpv20.build.partitions=default
dydk1a_mpv20.build.defines=
dydk1a_mpv20.build.loop_core=
dydk1a_mpv20.build.event_core=
dydk1a_mpv20.build.psram_type=qspi
dydk1a_mpv20.build.memory_type={build.boot}_{build.psram_type}

## IDE 2.0 Seems to not update the value
dydk1a_mpv20.menu.JTAGAdapter.default=Disabled
dydk1a_mpv20.menu.JTAGAdapter.default.build.copy_jtag_files=0
dydk1a_mpv20.menu.JTAGAdapter.builtin=Integrated USB JTAG
dydk1a_mpv20.menu.JTAGAdapter.builtin.build.openocdscript=dydk1a_mpv20-builtin.cfg
dydk1a_mpv20.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
dydk1a_mpv20.menu.JTAGAdapter.external=FTDI Adapter
dydk1a_mpv20.menu.JTAGAdapter.external.build.openocdscript=dydk1a_mpv20-ftdi.cfg
dydk1a_mpv20.menu.JTAGAdapter.external.build.copy_jtag_files=1
dydk1a_mpv20.menu.JTAGAdapter.bridge=ESP USB Bridge
dydk1a_mpv20.menu.JTAGAdapter.bridge.build.openocdscript=dydk1a_mpv20-bridge.cfg
dydk1a_mpv20.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

dydk1a_mpv20.menu.PSRAM.disabled=Disabled
dydk1a_mpv20.menu.PSRAM.disabled.build.defines=
dydk1a_mpv20.menu.PSRAM.disabled.build.psram_type=qspi
dydk1a_mpv20.menu.PSRAM.enabled=QSPI PSRAM
dydk1a_mpv20.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
dydk1a_mpv20.menu.PSRAM.enabled.build.psram_type=qspi
dydk1a_mpv20.menu.PSRAM.opi=OPI PSRAM
dydk1a_mpv20.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
dydk1a_mpv20.menu.PSRAM.opi.build.psram_type=opi

dydk1a_mpv20.menu.FlashMode.qio=QIO 80MHz
dydk1a_mpv20.menu.FlashMode.qio.build.flash_mode=dio
dydk1a_mpv20.menu.FlashMode.qio.build.boot=qio
dydk1a_mpv20.menu.FlashMode.qio.build.boot_freq=80m
dydk1a_mpv20.menu.FlashMode.qio.build.flash_freq=80m
dydk1a_mpv20.menu.FlashMode.qio120=QIO 120MHz
dydk1a_mpv20.menu.FlashMode.qio120.build.flash_mode=dio
dydk1a_mpv20.menu.FlashMode.qio120.build.boot=qio
dydk1a_mpv20.menu.FlashMode.qio120.build.boot_freq=120m
dydk1a_mpv20.menu.FlashMode.qio120.build.flash_freq=80m
dydk1a_mpv20.menu.FlashMode.dio=DIO 80MHz
dydk1a_mpv20.menu.FlashMode.dio.build.flash_mode=dio
dydk1a_mpv20.menu.FlashMode.dio.build.boot=dio
dydk1a_mpv20.menu.FlashMode.dio.build.boot_freq=80m
dydk1a_mpv20.menu.FlashMode.dio.build.flash_freq=80m
dydk1a_mpv20.menu.FlashMode.opi=OPI 80MHz
dydk1a_mpv20.menu.FlashMode.opi.build.flash_mode=dout
dydk1a_mpv20.menu.FlashMode.opi.build.boot=opi
dydk1a_mpv20.menu.FlashMode.opi.build.boot_freq=80m
dydk1a_mpv20.menu.FlashMode.opi.build.flash_freq=80m

dydk1a_mpv20.menu.FlashSize.4M=4MB (32Mb)
dydk1a_mpv20.menu.FlashSize.4M.build.flash_size=4MB
dydk1a_mpv20.menu.FlashSize.8M=8MB (64Mb)
dydk1a_mpv20.menu.FlashSize.8M.build.flash_size=8MB
dydk1a_mpv20.menu.FlashSize.8M.build.partitions=default_8MB
dydk1a_mpv20.menu.FlashSize.16M=16MB (128Mb)
dydk1a_mpv20.menu.FlashSize.16M.build.flash_size=16MB
#dydk1a_mpv20.menu.FlashSize.32M=32MB (256Mb)
#dydk1a_mpv20.menu.FlashSize.32M.build.flash_size=32MB

dydk1a_mpv20.menu.LoopCore.1=Core 1
dydk1a_mpv20.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
dydk1a_mpv20.menu.LoopCore.0=Core 0
dydk1a_mpv20.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

dydk1a_mpv20.menu.EventsCore.1=Core 1
dydk1a_mpv20.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
dydk1a_mpv20.menu.EventsCore.0=Core 0
dydk1a_mpv20.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

dydk1a_mpv20.menu.USBMode.hwcdc=Hardware CDC and JTAG
dydk1a_mpv20.menu.USBMode.hwcdc.build.usb_mode=1
dydk1a_mpv20.menu.USBMode.default=USB-OTG (TinyUSB)
dydk1a_mpv20.menu.USBMode.default.build.usb_mode=0

dydk1a_mpv20.menu.CDCOnBoot.cdc=Enabled
dydk1a_mpv20.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
dydk1a_mpv20.menu.CDCOnBoot.default=Disabled
dydk1a_mpv20.menu.CDCOnBoot.default.build.cdc_on_boot=0

dydk1a_mpv20.menu.MSCOnBoot.default=Disabled
dydk1a_mpv20.menu.MSCOnBoot.default.build.msc_on_boot=0
dydk1a_mpv20.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
dydk1a_mpv20.menu.MSCOnBoot.msc.build.msc_on_boot=1

dydk1a_mpv20.menu.DFUOnBoot.default=Disabled
dydk1a_mpv20.menu.DFUOnBoot.default.build.dfu_on_boot=0
dydk1a_mpv20.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
dydk1a_mpv20.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

dydk1a_mpv20.menu.UploadMode.default=UART0 / Hardware CDC
dydk1a_mpv20.menu.UploadMode.default.upload.use_1200bps_touch=false
dydk1a_mpv20.menu.UploadMode.default.upload.wait_for_upload_port=false
dydk1a_mpv20.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
dydk1a_mpv20.menu.UploadMode.cdc.upload.use_1200bps_touch=true
dydk1a_mpv20.menu.UploadMode.cdc.upload.wait_for_upload_port=true

dydk1a_mpv20.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
dydk1a_mpv20.menu.PartitionScheme.default.build.partitions=default
dydk1a_mpv20.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
dydk1a_mpv20.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
dydk1a_mpv20.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
dydk1a_mpv20.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
dydk1a_mpv20.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
dydk1a_mpv20.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
dydk1a_mpv20.menu.PartitionScheme.minimal.build.partitions=minimal
dydk1a_mpv20.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
dydk1a_mpv20.menu.PartitionScheme.no_ota.build.partitions=no_ota
dydk1a_mpv20.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
dydk1a_mpv20.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
dydk1a_mpv20.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
dydk1a_mpv20.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
dydk1a_mpv20.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
dydk1a_mpv20.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
dydk1a_mpv20.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
dydk1a_mpv20.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
dydk1a_mpv20.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
dydk1a_mpv20.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
dydk1a_mpv20.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
dydk1a_mpv20.menu.PartitionScheme.huge_app.build.partitions=huge_app
dydk1a_mpv20.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
dydk1a_mpv20.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
dydk1a_mpv20.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
dydk1a_mpv20.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
dydk1a_mpv20.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
dydk1a_mpv20.menu.PartitionScheme.fatflash.build.partitions=ffat
dydk1a_mpv20.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
dydk1a_mpv20.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
dydk1a_mpv20.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
dydk1a_mpv20.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
dydk1a_mpv20.menu.PartitionScheme.rainmaker=RainMaker
dydk1a_mpv20.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
dydk1a_mpv20.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

