deneyapkart/deneyapkart-arduino-core/boards.txt
dydk1a_mpv20.menu.CPUFreq.240=240MHz (WiFi)
dydk1a_mpv20.menu.CPUFreq.240.build.f_cpu=240000000L
dydk1a_mpv20.menu.CPUFreq.160=160MHz (WiFi)
dydk1a_mpv20.menu.CPUFreq.160.build.f_cpu=160000000L
dydk1a_mpv20.menu.CPUFreq.80=80MHz (WiFi)
dydk1a_mpv20.menu.CPUFreq.80.build.f_cpu=80000000L
dydk1a_mpv20.menu.CPUFreq.40=40MHz
dydk1a_mpv20.menu.CPUFreq.40.build.f_cpu=40000000L
dydk1a_mpv20.menu.CPUFreq.20=20MHz
dydk1a_mpv20.menu.CPUFreq.20.build.f_cpu=20000000L
dydk1a_mpv20.menu.CPUFreq.10=10MHz
dydk1a_mpv20.menu.CPUFreq.10.build.f_cpu=10000000L

dydk1a_mpv20.menu.UploadSpeed.921600=921600
dydk1a_mpv20.menu.UploadSpeed.921600.upload.speed=921600
dydk1a_mpv20.menu.UploadSpeed.115200=115200
dydk1a_mpv20.menu.UploadSpeed.115200.upload.speed=115200
dydk1a_mpv20.menu.UploadSpeed.256000.windows=256000
dydk1a_mpv20.menu.UploadSpeed.256000.upload.speed=256000
dydk1a_mpv20.menu.UploadSpeed.230400.windows.upload.speed=256000
dydk1a_mpv20.menu.UploadSpeed.230400=230400
dydk1a_mpv20.menu.UploadSpeed.230400.upload.speed=230400
dydk1a_mpv20.menu.UploadSpeed.460800.linux=460800
dydk1a_mpv20.menu.UploadSpeed.460800.macosx=460800
dydk1a_mpv20.menu.UploadSpeed.460800.upload.speed=460800
dydk1a_mpv20.menu.UploadSpeed.512000.windows=512000
dydk1a_mpv20.menu.UploadSpeed.512000.upload.speed=512000

dydk1a_mpv20.menu.DebugLevel.none=None
dydk1a_mpv20.menu.DebugLevel.none.build.code_debug=0
dydk1a_mpv20.menu.DebugLevel.error=Error
dydk1a_mpv20.menu.DebugLevel.error.build.code_debug=1
dydk1a_mpv20.menu.DebugLevel.warn=Warn
dydk1a_mpv20.menu.DebugLevel.warn.build.code_debug=2
dydk1a_mpv20.menu.DebugLevel.info=Info
dydk1a_mpv20.menu.DebugLevel.info.build.code_debug=3
dydk1a_mpv20.menu.DebugLevel.debug=Debug
dydk1a_mpv20.menu.DebugLevel.debug.build.code_debug=4
dydk1a_mpv20.menu.DebugLevel.verbose=Verbose
dydk1a_mpv20.menu.DebugLevel.verbose.build.code_debug=5

dydk1a_mpv20.menu.EraseFlash.none=Disabled
dydk1a_mpv20.menu.EraseFlash.none.upload.erase_cmd=
dydk1a_mpv20.menu.EraseFlash.all=Enabled
dydk1a_mpv20.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

dym_mpv10.name=Deneyap Mini

dym_mpv10.vid.0=0x303A
dym_mpv10.pid.0=0x8141

dym_mpv10.bootloader.tool=esptool_py
dym_mpv10.bootloader.tool.default=esptool_py

dym_mpv10.upload.tool=esptool_py
dym_mpv10.upload.tool.default=esptool_py
dym_mpv10.upload.tool.network=esp_ota

dym_mpv10.upload.maximum_size=1310720
dym_mpv10.upload.maximum_data_size=327680
dym_mpv10.upload.flags=
dym_mpv10.upload.extra_flags=
dym_mpv10.upload.use_1200bps_touch=false
dym_mpv10.upload.wait_for_upload_port=false

dym_mpv10.serial.disableDTR=false
dym_mpv10.serial.disableRTS=false

dym_mpv10.build.tarch=xtensa
dym_mpv10.build.bootloader_addr=0x1000
dym_mpv10.build.target=esp32s2
dym_mpv10.build.mcu=esp32s2
dym_mpv10.build.core=esp32
dym_mpv10.build.variant=dym_mpv10
dym_mpv10.build.board=DYM

dym_mpv10.build.serial=0
#dym_mpv10.build.cdc_on_boot=1
#dym_mpv10.build.msc_on_boot=0
#dym_mpv10.build.dfu_on_boot=0
dym_mpv10.build.f_cpu=240000000L
dym_mpv10.build.flash_size=4MB
dym_mpv10.build.flash_freq=80m
dym_mpv10.build.flash_mode=dio
dym_mpv10.build.flash_mode=qio
dym_mpv10.build.boot=qio
dym_mpv10.build.partitions=default
dym_mpv10.build.defines=

# IDE 2.0 Seems to not update the value
dym_mpv10.menu.JTAGAdapter.external=FTDI Adapter
dym_mpv10.menu.JTAGAdapter.external.build.openocdscript=esp32s2-kaluga-1.cfg
dym_mpv10.menu.JTAGAdapter.bridge=ESP USB Bridge
dym_mpv10.menu.JTAGAdapter.bridge.build.openocdscript=esp32s2-bridge.cfg

dym_mpv10.menu.CDCOnBoot.default=Enabled
dym_mpv10.menu.CDCOnBoot.default.build.cdc_on_boot=1
dym_mpv10.menu.CDCOnBoot.cdc=Disabled
dym_mpv10.menu.CDCOnBoot.cdc.build.cdc_on_boot=0

dym_mpv10.menu.MSCOnBoot.default=Disabled
dym_mpv10.menu.MSCOnBoot.default.build.msc_on_boot=0
dym_mpv10.menu.MSCOnBoot.msc=Enabled
dym_mpv10.menu.MSCOnBoot.msc.build.msc_on_boot=1

dym_mpv10.menu.DFUOnBoot.default=Disabled
dym_mpv10.menu.DFUOnBoot.default.build.dfu_on_boot=0
dym_mpv10.menu.DFUOnBoot.dfu=Enabled
dym_mpv10.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

dym_mpv10.menu.PSRAM.disabled=Disabled
dym_mpv10.menu.PSRAM.disabled.build.defines=
dym_mpv10.menu.PSRAM.enabled=Enabled
dym_mpv10.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM

dym_mpv10.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
dym_mpv10.menu.PartitionScheme.default.build.partitions=default
dym_mpv10.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
dym_mpv10.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
dym_mpv10.menu.PartitionScheme.default_8MB=8M Flash (3MB APP/1.5MB FAT)
dym_mpv10.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
dym_mpv10.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
dym_mpv10.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
dym_mpv10.menu.PartitionScheme.minimal.build.partitions=minimal
dym_mpv10.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
dym_mpv10.menu.PartitionScheme.no_ota.build.partitions=no_ota
dym_mpv10.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
dym_mpv10.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
dym_mpv10.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
dym_mpv10.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
dym_mpv10.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
dym_mpv10.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
dym_mpv10.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
dym_mpv10.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
dym_mpv10.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
dym_mpv10.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
dym_mpv10.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
dym_mpv10.menu.PartitionScheme.huge_app.build.partitions=huge_app
dym_mpv10.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
dym_mpv10.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
dym_mpv10.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
dym_mpv10.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
dym_mpv10.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
dym_mpv10.menu.PartitionScheme.fatflash.build.partitions=ffat
dym_mpv10.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
dym_mpv10.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9MB FATFS)
dym_mpv10.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
dym_mpv10.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
dym_mpv10.menu.PartitionScheme.rainmaker=RainMaker
dym_mpv10.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
dym_mpv10.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

