deneyapkart/deneyapkart-arduino-core/boards.txt
dyg_mpv10.menu.FlashMode.qio=QIO
dyg_mpv10.menu.FlashMode.qio.build.flash_mode=dio
dyg_mpv10.menu.FlashMode.qio.build.boot=qio
dyg_mpv10.menu.FlashMode.dio=DIO
dyg_mpv10.menu.FlashMode.dio.build.flash_mode=dio
dyg_mpv10.menu.FlashMode.dio.build.boot=dio
dyg_mpv10.menu.FlashMode.qout=QOUT
dyg_mpv10.menu.FlashMode.qout.build.flash_mode=dout
dyg_mpv10.menu.FlashMode.qout.build.boot=qout
dyg_mpv10.menu.FlashMode.dout=DOUT
dyg_mpv10.menu.FlashMode.dout.build.flash_mode=dout
dyg_mpv10.menu.FlashMode.dout.build.boot=dout

dyg_mpv10.menu.FlashFreq.80=80MHz
dyg_mpv10.menu.FlashFreq.80.build.flash_freq=80m
dyg_mpv10.menu.FlashFreq.40=40MHz
dyg_mpv10.menu.FlashFreq.40.build.flash_freq=40m

dyg_mpv10.menu.FlashSize.4M=4MB (32Mb)
dyg_mpv10.menu.FlashSize.4M.build.flash_size=4MB
dyg_mpv10.menu.FlashSize.8M=8MB (64Mb)
dyg_mpv10.menu.FlashSize.8M.build.flash_size=8MB
dyg_mpv10.menu.FlashSize.8M.build.partitions=default_8MB
dyg_mpv10.menu.FlashSize.2M=2MB (16Mb)
dyg_mpv10.menu.FlashSize.2M.build.flash_size=2MB
dyg_mpv10.menu.FlashSize.2M.build.partitions=minimal
dyg_mpv10.menu.FlashSize.16M=16MB (128Mb)
dyg_mpv10.menu.FlashSize.16M.build.flash_size=16MB

dyg_mpv10.menu.UploadSpeed.921600=921600
dyg_mpv10.menu.UploadSpeed.921600.upload.speed=921600
dyg_mpv10.menu.UploadSpeed.115200=115200
dyg_mpv10.menu.UploadSpeed.115200.upload.speed=115200
dyg_mpv10.menu.UploadSpeed.256000.windows=256000
dyg_mpv10.menu.UploadSpeed.256000.upload.speed=256000
dyg_mpv10.menu.UploadSpeed.230400.windows.upload.speed=256000
dyg_mpv10.menu.UploadSpeed.230400=230400
dyg_mpv10.menu.UploadSpeed.230400.upload.speed=230400
dyg_mpv10.menu.UploadSpeed.460800.linux=460800
dyg_mpv10.menu.UploadSpeed.460800.macosx=460800
dyg_mpv10.menu.UploadSpeed.460800.upload.speed=460800
dyg_mpv10.menu.UploadSpeed.512000.windows=512000
dyg_mpv10.menu.UploadSpeed.512000.upload.speed=512000

dyg_mpv10.menu.DebugLevel.none=None
dyg_mpv10.menu.DebugLevel.none.build.code_debug=0
dyg_mpv10.menu.DebugLevel.error=Error
dyg_mpv10.menu.DebugLevel.error.build.code_debug=1
dyg_mpv10.menu.DebugLevel.warn=Warn
dyg_mpv10.menu.DebugLevel.warn.build.code_debug=2
dyg_mpv10.menu.DebugLevel.info=Info
dyg_mpv10.menu.DebugLevel.info.build.code_debug=3
dyg_mpv10.menu.DebugLevel.debug=Debug
dyg_mpv10.menu.DebugLevel.debug.build.code_debug=4
dyg_mpv10.menu.DebugLevel.verbose=Verbose
dyg_mpv10.menu.DebugLevel.verbose.build.code_debug=5

dyg_mpv10.menu.EraseFlash.none=Disabled
dyg_mpv10.menu.EraseFlash.none.upload.erase_cmd=
dyg_mpv10.menu.EraseFlash.all=Enabled
dyg_mpv10.menu.EraseFlash.all.upload.erase_cmd=-e
